---
kind: type
id: T:Autodesk.Revit.DB.TriOrQuadFacet
source: html/9d1875be-5241-3381-2a56-674b2ee39d95.htm
---
# Autodesk.Revit.DB.TriOrQuadFacet

This class represents a triangle or quadrilateral in a faceted structure.

## Syntax (C#)
```csharp
public class TriOrQuadFacet : IDisposable
```

## Remarks
This class defines a triangle or quadrilateral with reference to an external triangulation structure.
 The vertices of this TriOrQuadFacet are indices into the triangulation structure's array of vertices.